In [1]:
'''In exercise folder (same level as this notebook on github) there is hiring.csv. This file contains hiring statics for a firm such as experience of candidate, his written test score and personal interview score. Based on these 3 factors, HR will decide the salary. Given this data, you need to build a machine learning model for HR department that can help them decide salaries for future candidates. Using this predict salaries for following candidates,

2 yr experience, 9 test score, 6 interview score

12 yr experience, 10 test score, 10 interview score

Answer
53713.86 and 93747.79'''

'In exercise folder (same level as this notebook on github) there is hiring.csv. This file contains hiring statics for a firm such as experience of candidate, his written test score and personal interview score. Based on these 3 factors, HR will decide the salary. Given this data, you need to build a machine learning model for HR department that can help them decide salaries for future candidates. Using this predict salaries for following candidates,\n\n2 yr experience, 9 test score, 6 interview score\n\n12 yr experience, 10 test score, 10 interview score\n\nAnswer\n53713.86 and 93747.79'

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv(r'hiring.csv')

In [3]:
data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [4]:
df2 = data.rename(columns={'test_score(out of 10)': 'test_score', 'interview_score(out of 10)': 'interview_score','salary($)':'salary'})

In [5]:
df2

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [6]:
!pip install word2number

Requirement already satisfied: word2number in e:\anaconda_saved_location\lib\site-packages (1.1)

In [7]:
from word2number import w2n

print (w2n.word_to_num("two million three thousand nine hundred and eighty four"))

2003984

In [8]:
import math

In [9]:
from word2number import w2n

def convert_to_number(n):
    try:
        return int(w2n.word_to_num(n))
    except ValueError:
        return n  # Return the original value if word_to_num raises a ValueError

# Apply the conversion function to the 'experience' column
exp = df2['experience'].apply(convert_to_number)
exp
exp2 = exp.fillna(0)
exp2 = exp2.astype(int)
exp2

0     0
1     0
2     5
3     2
4     7
5     3
6    10
7    11
Name: experience, dtype: int32

In [10]:
df2['experience'] = exp2

df2['test_score'] = df2['test_score'].fillna(0)

df2['test_score'] =df2['test_score'].astype(int)

In [11]:
df2.isnull().sum()
df2

   experience  test_score  interview_score  salary
0           0           8                9   50000
1           0           8                6   45000
2           5           6                7   60000
3           2          10               10   65000
4           7           9                6   70000
5           3           7               10   62000
6          10           0                7   72000
7          11           7                8   80000

In [12]:
df2.iloc[:,2]

0     9
1     6
2     7
3    10
4     6
5    10
6     7
7     8
Name: interview_score, dtype: int64

In [13]:
X=df2.iloc[:,:-1] #index_location(row, cloumn)
X.head()
Y=df2.iloc[:,-1]
X.head()

   experience  test_score  interview_score
0           0           8                9
1           0           8                6
2           5           6                7
3           2          10               10
4           7           9                6

In [14]:
from sklearn.model_selection import train_test_split
X_train,X_test,Y_train,Y_test = train_test_split(X,Y,test_size=0.2, random_state=42)

In [15]:
X_train

   experience  test_score  interview_score
0           0           8                9
7          11           7                8
2           5           6                7
4           7           9                6
3           2          10               10
6          10           0                7

In [16]:
from sklearn.linear_model import LinearRegression
reg = LinearRegression()

In [17]:
reg

LinearRegression()

In [18]:
reg.fit(X_train,Y_train)

LinearRegression()

In [19]:
reg.coef_

array([2996.78245144,  985.69717466, 1946.85173442])

In [20]:
reg.intercept_

26863.78261584349

In [21]:
reg.predict([[2,9,6]])

E:\anaconda_saved_location\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([53409.73249724])

In [22]:
reg.predict([[12,10,10]])

E:\anaconda_saved_location\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([92150.66112403])